---
kind: property
id: P:Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.Operation
source: html/9201c6cf-bc42-b5fc-f7f7-2318a14d74cd.htm
---
# Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.Operation Property

The operation associated with this event

## Syntax (C#)
```csharp
public FabricationPartBrowserOperation Operation { get; }
```